[
    {        
        "text": "My blogging partner Erin and I started working with Steve right after starting our blog. Technology is not a natural fit for either of us and Steve was instrumental in taking over the more technically involved aspects of the site & Wordpress. Best of all he created easy to understand videos that allowed us to figure out how to take over many of the tasks ourselves. We always found Steve extremely easy and pleasant to work with, very responsive to our needs, always willing to explain any aspect of his work and absolutely scrupulous in his work.",
        "commenter": "Tricia",
        "title": "co-founder",
        "company": "Suburban-Bees",
        "url": "https://www.suburban-bees.com/"
    },
    {
        "text": "Steve has assisted our team on numerous complex projects where a straightforward answer wasn’t always clear. He always seems able to find an outside perspective and a creative solution. He excels in front end development, responsive websites, content management systems, and customer service.  Many developers lack the communication skills to convey technical tasks to the client or management, but Steve has always excelled in this area. He also takes direction well and is self motivated.",
        "commenter": "Cory",
        "title": "co-owner",
        "company": "VisFire",
        "url": "https://visfire.com"
    },
    {
        "text": "Steve was in my sophomore computer science course during Spring 2016, and did very well, receiving an A- letter grade. This course combines computer architecture, combinational and sequential logic, state machines, assembly programming, numerical representation, and C programming. The course is traditionally very challenging for sophomore students, and many do not pass the first time through. Steve completed all assignments with an average of over 98.5%, thus showing a high degree of diligence. He also had perfect attendance on all labs, quizzes, and exams. In my opinion Steve is easily in the top 20% of the students I see, and I’m delighted to give him a recommendation.",
        "commenter": "Dr. Wilcox",
        "title": "professor",
        "company": "Colorado State University",
        "url": "https://www.cs.colostate.edu/~wilcox/"
    }
]
